In [1]:
import pandas as pd

In [3]:
items = {'Bob' : pd.Series(data = [245, 25, 55], index = ['bike', 'pants', 'watch']),
         'Alice' : pd.Series(data = [40, 110, 500, 45], index = ['book', 'glasses', 'bike', 'pants'])}

type(items)

dict

In [5]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [12]:
data = {
        'Bob': pd.Series([245, 25, 55]), 
        'Alice': pd.Series([40, 110, 500, 45])
}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [15]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [16]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [17]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [18]:
shopping_carts.shape

(5, 2)

In [19]:
shopping_carts.ndim

2

In [20]:
shopping_carts.size

10

In [22]:
bob_shopping_cart = pd.DataFrame(items, columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [23]:
sel_shopping_cart = pd.DataFrame(items, index=['pants', 'book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [24]:
alice_shopping_cart = pd.DataFrame(items, columns=['Alice'])
alice_shopping_cart

         Alice
book        40
glasses    110
bike       500
pants       45

In [25]:
alice_sel_shopping_cart = pd.DataFrame(items, columns=['Alice'], index=['book', 'glasses'])
alice_sel_shopping_cart

         Alice
book        40
glasses    110

In [27]:
data = {'Integers': [1, 2, 3], 'Floats': [4.5, 8.2, 9.6]}
df = pd.DataFrame(data, index=['Label 1', 'Label 2', 'Label 3'])
df

         Integers  Floats
Label 1         1     4.5
Label 2         2     8.2
Label 3         3     9.6

In [43]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]

store_items = pd.DataFrame(items2, index=['Store 1', 'Store 2'])

store_items

         bikes  pants  watches  glasses
Store 1     20     30       35      NaN
Store 2     15      5       10     50.0

In [31]:
print('How many bikes are in each store:\n', store_items[['bikes']])
print('How many bikes and pants are in each store:\n', store_items[['bikes', 'pants']])
print('What items are in Store 1:\n', store_items.loc[['Store 1']])
print('How many bikes are in Store 2:', store_items['bikes']['Store 2'])

How many bikes are in each store:
          bikes
Store 1     20
Store 2     15
How many bikes and pants are in each store:
          bikes  pants
Store 1     20     30
Store 2     15      5
What items are in Store 1:
          bikes  pants  watches  glasses
Store 1     20     30       35      NaN
How many bikes are in Store 2: 15

In [44]:
store_items['shirts'] = [15, 2]
store_items

         bikes  pants  watches  glasses  shirts
Store 1     20     30       35      NaN      15
Store 2     15      5       10     50.0       2

In [45]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  pants  watches  glasses  shirts  suits
Store 1     20     30       35      NaN      15     45
Store 2     15      5       10     50.0       2      7

In [46]:
new_items = [{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}]
new_store = pd.DataFrame(new_items, index=['Store 3'])
new_store

         bikes  pants  watches  glasses
Store 3     20     30       35        4

In [71]:
store_items = store_items.append(new_store)
store_items

         bikes  glasses  new_watches  pants  shirts  suits  watches
Store 1     20      NaN         35.0     30    15.0   45.0       35
Store 2     15     50.0         10.0      5     2.0    7.0       10
Store 3     20      4.0          NaN     30     NaN    NaN       35

In [70]:
store_items.drop('Store 3', inplace=True)
store_items

KeyError: "['Store 3'] not found in axis"

In [73]:
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  glasses  new_watches  pants  shirts  suits  watches
Store 1     20      NaN          NaN     30    15.0   45.0       35
Store 2     15     50.0         10.0      5     2.0    7.0       10
Store 3     20      4.0         35.0     30     NaN    NaN       35

In [78]:
store_items.insert(5, 'shoes', [8, 5, 0])
#store_items.pop('shoes')
store_items

         bikes  glasses  new_watches  pants  shirts  shoes  suits  watches
Store 1     20      NaN          NaN     30    15.0      8   45.0       35
Store 2     15     50.0         10.0      5     2.0      5    7.0       10
Store 3     20      4.0         35.0     30     NaN      0    NaN       35

In [79]:
store_items.pop('new_watches')
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
Store 1     20      NaN     30    15.0      8   45.0       35
Store 2     15     50.0      5     2.0      5    7.0       10
Store 3     20      4.0     30     NaN      0    NaN       35

In [80]:
store_items = store_items.drop(['watches', 'shoes'], axis=1)
store_items

         bikes  glasses  pants  shirts  suits
Store 1     20      NaN     30    15.0   45.0
Store 2     15     50.0      5     2.0    7.0
Store 3     20      4.0     30     NaN    NaN

In [82]:
store_items = store_items.drop(['Store 1', 'Store 2'], axis=0)
store_items

         hats  glasses  pants  Shirts  suits
Store 3    20      4.0     30     NaN    NaN

In [83]:
store_items = store_items.rename(columns={'bikes': 'hats', 'shirts': 'Shirts'})
store_items

         hats  glasses  pants  Shirts  suits
Store 3    20      4.0     30     NaN    NaN

In [85]:
store_items = store_items.rename(index={'Store 3': 'The Final Store'})
store_items

                 hats  glasses  pants  Shirts  suits
The Final Store    20      4.0     30     NaN    NaN

In [86]:
store_items = store_items.set_index('pants')
store_items

       hats  glasses  Shirts  suits
pants
30       20      4.0     NaN    NaN

In [ ]:
# Dealing with NAN

In [87]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]
store_items = pd.DataFrame(items2, index = ['store 1', 'store 2', 'store 3'])
store_items

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [89]:
x = store_items.isnull().sum().sum()
x

3

In [90]:
store_items.count()

bikes      3
pants      3
watches    3
shirts     2
shoes      3
suits      2
glasses    2
dtype: int64

In [91]:
store_items.dropna(axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 2     15      5       10     2.0      5    7.0     50.0

In [92]:
store_items.dropna(axis=1)

         bikes  pants  watches  shoes
store 1     20     30       35      8
store 2     15      5       10      5
store 3     20     30       35     10

In [93]:
store_items.fillna(0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      0.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     0.0     10    0.0      4.0

In [97]:
store_items.fillna(method='ffill', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [98]:
store_items.fillna(method='ffill', axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    35.0   10.0   10.0      4.0

In [99]:
store_items.fillna(method='backfill', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0     50.0
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     NaN     10    NaN      4.0

In [100]:
store_items.fillna(method='backfill', axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0      NaN
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    10.0   10.0    4.0      4.0

In [101]:
store_items.interpolate(method='linear', axis=0)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1     20     30       35    15.0      8   45.0      NaN
store 2     15      5       10     2.0      5    7.0     50.0
store 3     20     30       35     2.0     10    7.0      4.0

In [102]:
store_items.interpolate(method='linear', axis=1)

         bikes  pants  watches  shirts  shoes  suits  glasses
store 1   20.0   30.0     35.0    15.0    8.0   45.0     45.0
store 2   15.0    5.0     10.0     2.0    5.0    7.0     50.0
store 3   20.0   30.0     35.0    22.5   10.0    7.0      4.0

In [107]:
import numpy as np

# DO NOT CHANGE THE VARIABLE NAMES

# Set the precision of our dataframes to one decimal place.
pd.set_option('precision', 1)

# Create a Pandas DataFrame that contains the ratings some users have given to a series of books. 
# The ratings given are in the range from 1 to 5, with 5 being the best score. 
# The names of the books, the corresponding authors, and the ratings of each user are given below:

books = pd.Series(data = ['Great Expectations', 'Of Mice and Men', 'Romeo and Juliet', 'The Time Machine', 'Alice in Wonderland' ])
authors = pd.Series(data = ['Charles Dickens', 'John Steinbeck', 'William Shakespeare', ' H. G. Wells', 'Lewis Carroll' ])

# User ratings are in the order of the book titles mentioned above
# If a user has not rated all books, Pandas will automatically consider the missing values as NaN.
# If a user has mentioned `np.nan` value, then also it means that the user has not yet rated that book.
user_1 = pd.Series(data = [3.2, np.nan ,2.5])
user_2 = pd.Series(data = [5., 1.3, 4.0, 3.8])
user_3 = pd.Series(data = [2.0, 2.3, np.nan, 4])
user_4 = pd.Series(data = [4, 3.5, 4, 5, 4.2])


# Use the data above to create a Pandas DataFrame that has the following column
# labels: 'Author', 'Book Title', 'User 1', 'User 2', 'User 3', 'User 4'. 
# Let Pandas automatically assign numerical row indices to the DataFrame. 

# TO DO: Create a dictionary with the data given above
dat = {'Book Title' : books,
       'Author' : authors,
       'User 1' : user_1,
       'User 2' : user_2,
       'User 3' : user_3,
       'User 4' : user_4}

# TO DO: Create a Pandas DataFrame using the dictionary created above
book_ratings = pd.DataFrame(dat)

In [131]:
##Level Up

## From the DataFrame above can you now pick all the books that had a rating of 5?
## Hint - You can do this in just one line of code, by using pandas.DataFrame.any.

five = book_ratings[(book_ratings==5).any(axis=1)]['Book Title'].values
print('5-Star books: ', f'{five}')

5-Star books:  ['Great Expectations' 'The Time Machine']